Revit 2027 API
FabricationRodInfo.AttachToStructure Method
 Attaches to the nearest structural element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AttachToStructure()
Public Sub AttachToStructure
public:
void AttachToStructure()
member AttachToStructure : unit -> unit
See Also
Reference
FabricationRodInfo Class
Autodesk.Revit.DB Namespace